app/controllers/movies_controller.rb

  def show
    @movie=Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1